Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/question_time.html.txt.tmx
Source language: en
Languages: ga

source: Question time in Dáil Éireann
ga: Tráth na gceisteanna i nDáil Éireann

source: Dáil Éireann allocates a certain amount of time on Tuesdays, Wednesdays and Thursdays during which deputies (TDs) may ask questions of members of the Government relating to public affairs connected with their departments or on matters of administration for whch they are officially responsible
ga: Cuireann Dáil Éireann méid áirithe ama ar leataobh ar an Máirt, an Chéadaoin agus Déardaoin d’fhonn gur féidir le teachtaí dála (TDanna) ceisteanna a chur ar chomhaltaí an Rialtais a bhaineann le gnóthaí poiblí maidir lena rannóga nó le ceisteanna riaracháin a bhfuil freagracht oifigiúil orthu ina leith

source: The questions are referred to as parliamentary questions or PQs
ga: Tugtar ceisteanna parlaiminteacha nó cpanna ar na ceisteanna

source: The Taoiseach answers questions on Tuesdays in respect of matters relating to the administration of his own department
ga: Freagraíonn an Taoiseach ceisteanna ar an Máirt maidir le ceisteanna a bhaineann le riar a rannóige féin

source: Other members of the Government reply to questions on an agreed rota basis
ga: Freagraíonn comhaltaí eile an Rialtais ceisteanna ar bhonn uainchlár comhaontaithe

source: The rota repeats itself every 5 weeks or so, giving the opportunity to Deputies to question each minister on a regular basis
ga: Atosaítear an t-uainchlár gach 5 seachtaine nó mar sin de, agus tugtar an deis do na Teachtaí Dála chun ceist a chur ar gach aire ar bhonn rialta

source: Currently, the Minister for Health sends questions referring to the executive function of the health service to the HSE for reply
ga: Faoi láthair, seolann an tAire Sláinte ceisteanna a bhaineann le feidhm feidhmiúcháin na seirbhíse sláinte chuig FSS go dtabharfar freagra orthu

source: TDs are limited to asking each minister 2 oral questions
ga: Cuirtear teorainn ar TDanna gan ach 2 cheist ó bhéal a chur ar gach aire

source: Every day, 5 oral questions are given priority
ga: Gach lá, tugtar tús áite do 5 cheist ó bhéal

source: The priority questions are shared between the parties according to party strength
ga: Déantar na ceisteanna a dtugtar tús áite dóibh a roinnt idir na páirtithe de réir threise an pháirtí

source: As well as oral questions in question time, TDs can submit written questions seeking a written answer
ga: Anuas ar cheisteanna ó bhéal le linn thráth na gceisteanna, féadfaidh TDanna ceisteanna scríofa a sheoladh ina lorgaítear freagra scríofa

source: There is no limit to the amount of written questions that a TD can ask the Government
ga: Ní leagtar aon teorainn ar an méid ceisteanna scríofa ar féidir le TD a chur ar an Rialtas

source: The member of the Government must be given 3 days' notice for priority oral questions and 4 days' notice for other questions
ga: Ní mór fógra 3 lá a thabhairt don chomhalta Rialtais le haghaidh ceisteanna ó bhéal a dtugtar tús áite dóibh agus fógra 4 lá i dtaobh ceisteanna eile

source: Sometimes a very urgent matter of public importance will suddenly arise
ga: Tiocfaidh ceist an-phráinneach lena mbaineann tábhacht phoiblí aníos go tobann, amanna

source: The Ceann Comhairle may accept questions about an urgent issue at very short notice
ga: Féadfaidh an Ceann Comhairle glacadh le ceisteanna faoi shaincheist phráinneach i ndiaidh fógra an-ghearr a fháil

source: These questions are called "private notice" questions and are taken at the end of question time
ga: Tugtar ceisteanna “fógra phríobháidigh” ar na ceisteanna seo agus glactar leo ag deireadh thráth na gceisteanna

source: The Oireachtas publishes the replies to parliamentary questions daily as part of the Dáil Debates
ga: Foilsíonn an tOireachtas na freagraí ar na ceisteanna parlaiminteacha gach lá mar chuid de Dhíospóidí na Dála

source: Dáil debates are published incrementally throughout a sitting day
ga: Foilsítear díospóireachtaí na Dála ar bhonn breisíoch le linn lá suite

source: All proceedings before 7pm are published before midnight, the remainder being added the following day
ga: Foilsítear gach imeacht roimh 7pm roimh mheán oíche, agus cuirtear an fuílleach díobh leis an lá dar gcionn

source: Seanad debates are published incrementally on a same day or next day basis
ga: Foilsítear díospóireachtaí an tSeanaid ar bhonn breisíoch ar bonn an lae chéanna nó an lae dar gcionn

source: Replies to questions tabled by members for written response by ministers are published at the end of each day's Dáil proceedings
ga: Foilsítear freagraí ar cheisteanna a rangaigh comhaltaí le haghaidh freagra i scríbhinn ag Airí ag deireadh gach lá imeachta sa Dáil

source: The Official Report of each committee meeting is published within a week at latest, but generally within 2 to 3 working days
ga: Foilsítear Tuarascáil Oifigiúil chruinniú gach coiste laistigh de sheachtain ar a dhéanaí, ach is gnách go bhfoilsítear iad laistigh de 2/3 lá oibre
